possible directions: remove empty values, remove stop words, find most common words

In [2]:
import pandas as pd

df = pd.read_csv('data.csv')
df

,title,content,score
0,LSE accomodation for couples,Hi! \n\nI will be moving with my partner to Lo...,3
1,which accommodation do rich international stud...,where do rich students live during their studi...,0
2,Bankside or Garden Hall,Im a general course student and can't choose b...,2
3,Is the reserve list separate from an ordinary ...,I got placed on a reserve list for the Masters...,2
4,Postgraduate housing,Hello! I was just accepted into LSE for my mas...,2
...,...,...,...
846,Update to waiting for decades + advice for fut...,Hi! I made [a post](https://www.reddit.com/r/T...,12
847,Advice on Teachers Reference for Undergrad App...,As part of my undergrad application to LSE for...,2
848,international undergrad applicants???,a bunch of people i know still haven’t receive...,3
849,Winter/March holidays,So am I wrong or are the winter and March/Apri...,1
850,Differemt price for the same room?,Hi. Was checking room availability at Passfiel...,2

In [3]:
import nltk
from nltk.corpus import stopwords
sw = stopwords.words('English')

stop_words = set(stopwords.words('english'))
df['title'] = df['title'].apply(lambda x: ' '.join([word for word in x.split() if word.lower() not in stop_words]))
df['content'] = df['title'].apply(lambda x: ' '.join([word for word in x.split() if word.lower() not in stop_words]))
df.head()

,title,content,score
0,LSE accomodation couples,LSE accomodation couples,3
1,accommodation rich international student stay in?,accommodation rich international student stay in?,0
2,Bankside Garden Hall,Bankside Garden Hall,2
3,reserve list separate ordinary waitlist?,reserve list separate ordinary waitlist?,2
4,Postgraduate housing,Postgraduate housing,2

In [4]:
df.dropna(inplace = True)
df.head()

,title,content,score
0,LSE accomodation couples,LSE accomodation couples,3
1,accommodation rich international student stay in?,accommodation rich international student stay in?,0
2,Bankside Garden Hall,Bankside Garden Hall,2
3,reserve list separate ordinary waitlist?,reserve list separate ordinary waitlist?,2
4,Postgraduate housing,Postgraduate housing,2

In [7]:
import collections 
all_text_title = ' '.join(df['title'])
word_counts = collections.Counter(all_text_title.split())
print(word_counts.most_common(100))

[('LSE', 182), ('MSc', 68), ('vs', 31), ('Economics', 31), ('-', 30), ('offer', 29), ('Graduate', 28), ('student', 27), ('anyone', 27), ('Finance', 25), ('LSE?', 24), ('accommodation', 23), ('application', 23), ('Student', 23), ('International', 22), ('year', 22), ('Summer', 21), ('Accommodation', 21), ('get', 20), ('BSc', 20), ('students', 18), ('&amp;', 18), ('first', 18), ('undergrad', 17), ('Undergraduate', 17), ('lse', 16), ('School', 16), ('apply', 15), ('Application', 15), ('Political', 15), ('Msc', 15), ('.', 15), ('got', 14), ('Support', 13), ('course', 13), ('international', 12), ('Hall', 12), ('Science', 12), ('admissions', 11), ('Urbanest', 11), ('heard', 11), ('Course', 11), ('Undergrad', 11), ('masters', 11), ('?', 11), ('Bsc', 11), ('entry', 10), ('graduate', 10), ('economics', 10), ('2023', 10), ('UK', 10), ('advice', 10), ('courses', 10), ('passfield', 10), ('social', 10), ('best', 9), ('History', 9), ('Statement', 9), ('finance', 9), ('Scheme', 9), ('application?', 9), ('Questions', 9), ('Social', 9), ('Mathematics', 9), ('Looking', 9), ('summer', 9), ('2', 9), ('London', 9), ('requirements', 8), ('Statistics', 8), ('Group', 8), ('financial', 8), ('awards?', 8), ('Culture', 8), ('General', 8), ('online', 8), ('Admission', 8), ('Masters', 8), ('group', 8), ('Econ', 8), ('Personal', 8), ('Applying', 8), ("Master's", 8), ('management', 8), ('Help', 8), ('general', 8), ('Sidney', 8), ('waiting', 8), ('Advice', 8), ('Financial', 8), ('Bankside', 7), ('Garden', 7), ('Postgraduate', 7), ('PPE', 7), ('Relations', 7), ('Economic', 7), ('Housing', 7), ('UCL', 7), ('holders', 7), ('bsc', 7)]

In [8]:
all_text_content = ' '.join(df['content'])
word_counts = collections.Counter(all_text_content.split())
print(word_counts.most_common(100))

[('LSE', 182), ('MSc', 68), ('vs', 31), ('Economics', 31), ('-', 30), ('offer', 29), ('Graduate', 28), ('student', 27), ('anyone', 27), ('Finance', 25), ('LSE?', 24), ('accommodation', 23), ('application', 23), ('Student', 23), ('International', 22), ('year', 22), ('Summer', 21), ('Accommodation', 21), ('get', 20), ('BSc', 20), ('students', 18), ('&amp;', 18), ('first', 18), ('undergrad', 17), ('Undergraduate', 17), ('lse', 16), ('School', 16), ('apply', 15), ('Application', 15), ('Political', 15), ('Msc', 15), ('.', 15), ('got', 14), ('Support', 13), ('course', 13), ('international', 12), ('Hall', 12), ('Science', 12), ('admissions', 11), ('Urbanest', 11), ('heard', 11), ('Course', 11), ('Undergrad', 11), ('masters', 11), ('?', 11), ('Bsc', 11), ('entry', 10), ('graduate', 10), ('economics', 10), ('2023', 10), ('UK', 10), ('advice', 10), ('courses', 10), ('passfield', 10), ('social', 10), ('best', 9), ('History', 9), ('Statement', 9), ('finance', 9), ('Scheme', 9), ('application?', 9), ('Questions', 9), ('Social', 9), ('Mathematics', 9), ('Looking', 9), ('summer', 9), ('2', 9), ('London', 9), ('requirements', 8), ('Statistics', 8), ('Group', 8), ('financial', 8), ('awards?', 8), ('Culture', 8), ('General', 8), ('online', 8), ('Admission', 8), ('Masters', 8), ('group', 8), ('Econ', 8), ('Personal', 8), ('Applying', 8), ("Master's", 8), ('management', 8), ('Help', 8), ('general', 8), ('Sidney', 8), ('waiting', 8), ('Advice', 8), ('Financial', 8), ('Bankside', 7), ('Garden', 7), ('Postgraduate', 7), ('PPE', 7), ('Relations', 7), ('Economic', 7), ('Housing', 7), ('UCL', 7), ('holders', 7), ('bsc', 7)]